app/controllers/reports_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def index
    @user = User.find(params[:id])