app/models/reading.rb

SELECT COUNT(*) FROM `readings` WHERE `readings`.`user_id` = 1 AND (recorded_at >= '2022-03-14 18:30:00')
---
  def daily_limit?
    errors.add(:daily_limit, 'Daily Limit Reached') if user.readings.today.size > (DAILY_LIMIT - 1)

SELECT `readings`.* FROM `readings` WHERE `readings`.`id` = 293 LIMIT 1
INSERT INTO `readings` (`data`, `recorded_at`, `user_id`, `created_at`, `updated_at`) VALUES (180, '2022-03-15 05:30:00', 1, '2022-03-15 05:30:49.483228', '2022-03-15 05:30:49.483228')
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def self.create_or_update_daily_readings(readings, user)
    errors = {}
    error_flag = false
    readings.each do |id, reading|
      id = id.to_i
      if id.positive?
        record = Reading.find_by_id(id)
      else
        record = Reading.new
        record.user_id = user.id
      end
      record.data = reading[:data]
      record.recorded_at = reading[:recorded_at].to_time
      if record.valid?
        record.save!
      else
        error_flag = true
        errors[id] = {
          data: record.errors[:data].first,
          recorded_at: record.errors[:recorded_at].first

SELECT `readings`.`id` FROM `readings` WHERE `readings`.`user_id` = 1 AND (recorded_at >= '2022-03-14 18:30:00')
---
  def self.delete_daily_readings(readings, user)
    delete_reading_ids = user.readings.today.ids - readings.keys&.map(&:to_i)